In [1]:
import pandas as pd

In [2]:
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

In [3]:
exam_data

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [4]:
df = pd.DataFrame(exam_data, index=['기영', '기철', '도준'])

In [5]:
df

    수학  영어   음악   체육
기영  90  98   85  100
기철  80  89   95   90
도준  70  95  100   90

In [6]:
df['국어'] = [10, 20, 30]

In [7]:
df

    수학  영어   음악   체육  국어
기영  90  98   85  100  10
기철  80  89   95   90  20
도준  70  95  100   90  30

In [9]:
df['사회'] = 100

In [10]:
df

    수학  영어   음악   체육  국어   사회
기영  90  98   85  100  10  100
기철  80  89   95   90  20  100
도준  70  95  100   90  30  100

In [11]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [12]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
df.set_index('이름')

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [24]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [25]:
df = df.transpose()
df

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [26]:
df = df.T
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90